{
  "vin": "7FARW2H94NE052460",
  "year": 2022,
  "make": "Honda",
  "model": "CR-V",
  "trim": "AWD Touring",
  "price": 20449,
  "mileage": 39618,
  "exteriorColor": "Slate",
  "interiorColor": "Black",
  "transmission": "Automatic",
  "engine": "1.5L I-4 gasoline direct injection, DOHC, variable valve control",
  "drivetrain": "All-wheel Drive",
  "description": "2022 Honda CR-V AWD Touring $29,239 Check availability Contact seller First name Last name Email Phone (optional) Check availabilityGet a price quoteSchedule a test driveDiscuss financingAsk a question Subject I'd like to know if the Used 2022 Honda CR-V AWD Touring you have listed on Cars.com for $29,239 is still available. Comments I have a trade in Choose a makeACAcuraAlfa RomeoAmerican MotorsAm GeneralAston MartinAuburnAudiAustinAustin-HealeyAvanti MotorsBentleyBMWBremenBricklinBugattiBuickCadillacCheckerChevroletChryslerCitroenCordCrosleyDaewooDaihatsuDatsunDelahayeDeloreanDesotoDeTomasoDodgeEagleEdselEssexExcaliburFacel-VegaFerrariFIATFiskerFordFranklinGAZGenesisGeoGMCGriffithHondaHudsonHummerHupmobileHyundaiINEOSINFINITIInternationalIsuzuJaguarJeepJensenKaiserKarmaKiaKoenigseggLamborghiniLanciaLand RoverLaSalleLexusLincolnLotusLucidMaseratiMaybachMazdaMcLarenMercedes-BenzMercuryMerkurMGMINIMitsubishiMorganMorrisNashNissanOldsmobileOpelPackardPaganiPaigePanozPeugeotPierce-ArrowPlymouthPolestarPontiacPorscheQvaleRAMRamblerRenaultRivianRolls-RoyceRoverSaabSaleenSaturnScionsmartSpykerSterlingStudebakerStutzSubaruSunbeamSuzukiTeslaToyotaTriumphTVRVinFastVolkswagenVolvoWillysYugo Make Choose a model Model Choose a year Year Exterior color Mileage VIN (optional) Check availability By clicking here, you authorize Cars.com and its sellers/partners to contact you by text/calls which may include marketing and be by autodialer. Calls may be prerecorded. You also agree to our Privacy Notice. Consent is not required to purchase goods/services. We value your privacy. Cars.com Privacy Notice window.addEventListener(\"scroll\", function(event) { event.stopImmediatePropagation(); }); .hidden { display: none !important; } @media all and (min-width: 61.25rem) { #sticky-footer { display: inherit; background-color: #fff; bottom: 0; box-shadow: 0 -2px 4px #bdbdbd; height: 90px; left: 0; margin: 0 auto; opacity: 1; position: fixed; text-align: center; width: 100%; z-index: 999; } } #sticky-footer:has(#phx-ignore-container-sticky-footer-ad-container:empty, #phx-ignore-container-sitcky-footer-ad-container div:empty) { display: none; } Home Shop other used 2022 Honda CR-Vs Used 2022 Honda CR-V AWD Touring {\"@context\":\"http:\\/\\/schema.org\",\"@type\":\"BreadcrumbList\",\"itemListElement\":[{\"@type\":\"ListItem\",\"item\":{\"@id\":\"https:\\/\\/www.cars.com\\/\",\"name\":\"Home\"},\"position\":1},{\"@type\":\"ListItem\",\"item\":{\"@id\":\"https:\\/\\/www.cars.com\\/shopping\\/honda-cr_v-2022\\/\",\"name\":\"Shop other used 2022 Honda CR-Vs\"},\"position\":2},{\"@type\":\"ListItem\",\"item\":{\"@id\":\"https:\\/\\/www.cars.com\\/vehicledetail\\/cd73fece-e12e-4557-a71f-71b801433933\\/\",\"name\":\"Used 2022 Honda CR-V AWD Touring\"},\"position\":3}]} No selected offer available Used 2022 Honda CR-V AWD Touring 18,518 mi. $29,239 Est. $545/mo* Est. Not Priced /mo* Down Payment $0 Net trade-in value $0 Months 72 APR 7.0% Sales tax 9.38% *Estimated payments are calculated by Cars.com and are for informational purposes only. We’ve estimated your taxes based on your provided ZIP code. These estimates do not include title, registration fees, lien fees, or any other fees that may be imposed by a governmental agency in connection with the sale and financing of the vehicle. Other taxes may apply. They do not represent a financing offer or a guarantee of credit from the seller. Actual terms vary by lender. **Your Saved Vehicles list will be shared along with your contact information when you submit a vehicle request to a dealership. To opt out of this sharing, please view your options on Cars.com Privacy Notice. Good Deal Deal Gauge™ Powered by Cars.com We compared this car with similar 2022 Honda CR-Vs based on price, mileage, features, condition, and several other factors. Avg. market price range $26.8K $28.5K $30.2K $31.9K duotone-map-pinA stylized map pin. duotone-car $29,239 This is a good deal. What goes into the Deal Gauge™ price analysis? 100+ variables feed our Cars.com price analysis, which contains the seller’s listing information. The ultimate accuracy of the Deal Gauge™ is dependent on all such variables, and the seller is responsible for the accuracy of the information included within this listing. Market Supply & demand Price Original MSRP Listing details Add-on packages Feature upgrades (e.g. alloy wheels, bluetooth) Exterior & interior colors Vehicle history (when available) Seller Dealer ratings & reviews Our Cars.com price analysis is only an estimate to give you a head start on research. We always recommend contacting the seller of the car for more information on what factors impact its price. When possible, schedule a test drive for yourself. How is it a “fair deal” if it’s higher than the average market range? If a car is priced within a certain proximity of the average market range, we consider it “fair” because there may be details about this car that are unknown to Cars.com. Examples include aftermarket add-ons, pristine condition evaluations, and additional factors that increase value. We always recommend contacting the seller of this car for more information. Contact seller () - Call (888) 621-9245 First name Last name Email Phone (optional) Check availabilityGet a price quoteSchedule a test driveDiscuss financingAsk a question Subject I'd like to know if the Used 2022 Honda CR-V AWD Touring you have listed on Cars.com for $29,239 is still available. Comments I have a trade in Choose a makeACAcuraAlfa RomeoAmerican MotorsAm GeneralAston MartinAuburnAudiAustinAustin-HealeyAvanti MotorsBentleyBMWBremenBricklinBugattiBuickCadillacCheckerChevroletChryslerCitroenCordCrosleyDaewooDaihatsuDatsunDelahayeDeloreanDesotoDeTomasoDodgeEagleEdselEssexExcaliburFacel-VegaFerrariFIATFiskerFordFranklinGAZGenesisGeoGMCGriffithHondaHudsonHummerHupmobileHyundaiINEOSINFINITIInternationalIsuzuJaguarJeepJensenKaiserKarmaKiaKoenigseggLamborghiniLanciaLand RoverLaSalleLexusLincolnLotusLucidMaseratiMaybachMazdaMcLarenMercedes-BenzMercuryMerkurMGMINIMitsubishiMorganMorrisNashNissanOldsmobileOpelPackardPaganiPaigePanozPeugeotPierce-ArrowPlymouthPolestarPontiacPorscheQvaleRAMRamblerRenaultRivianRolls-RoyceRoverSaabSaleenSaturnScionsmartSpykerSterlingStudebakerStutzSubaruSunbeamSuzukiTeslaToyotaTriumphTVRVinFastVolkswagenVolvoWillysYugo Make Choose a model Model Choose a year Year Exterior color Mileage VIN (optional) Check availability By clicking here, you authorize Cars.com and its sellers/partners to contact you by text/calls which may include marketing and be by autodialer. Calls may be prerecorded. You also agree to our Privacy Notice. Consent is not required to purchase goods/services. We value your privacy. Cars.com Privacy Notice Ad Car shopper resources Get your FICO® Score - Free Get your FICO® Score - Free The first step to taking control of your credit is knowing your FICO® Score. Learn more Stay on top of your credit. Sign up now. Learn more Basics Exterior color Slate Interior color Black Drivetrain All-wheel Drive MPG 27–32 Based on EPA mileage ratings. Use for comparison purposes only. Actual mileage will vary depending on driving conditions, driving habits, vehicle maintenance, and other factors. Fuel type Gasoline Transmission Automatic Engine 1.5L I-4 gasoline direct injection, DOHC, variable valve control VIN 7FARW2H94NE052460 Stock # TC6712A Mileage 18,518 mi. Features Convenience Adaptive Cruise Control Heated Seats Heated Steering Wheel Keyless Entry Keyless Start Navigation System Power Liftgate Remote Start Entertainment Android Auto® Apple CarPlay® Bluetooth® HomeLink USB Port Exterior Alloy Wheels Moonroof Safety Automatic Emergency Braking Backup Camera Blind Spot Monitor Brake Assist LED Headlights Lane Departure Warning Rear Cross Traffic Alert Stability Control Seating Leather Seats Memory Seat Additional popular features: headlight control - auto highbeam, Premium Sound System, apple carplay/android auto, driver monitor, collision warning system View all features Features These features are associated with this vehicle type. Contact the seller to confirm this specific vehicle has them. 1.5L I-4 16-Valve DOHC Engine with Turbocharger 12V power outlets 1 12V power outlet 3-point seatbelt Rear seat center 3-point seatbelt 4WD type Real Time AWD w/Intelligent Control System automatic full-time AWD ABS Brakes 4-wheel antilock (ABS) brakes ABS Brakes Four channel ABS brakes Accessory power Retained accessory power Adaptive Cruise Control Adaptive cruise control Adaptive Cruise Control (ACC) with Low-Speed Follow Air conditioning Yes All Wheel Drive All-in-one key All-in-one remote fob and ignition key Alternator Type Alternator Ambient lighting Amplifier 330W amplifier Android Auto Antenna Integrated roof audio antenna Apple CarPlay Armrests front center Sliding front seat center armrest Armrests rear Rear seat center armrest Audio theft deterrent Audio system theft deterrent Auto door locks Auto-locking doors Auto headlights Programmable headlight control Auto high-beam headlights Automatic Emergency Braking Automatic brake hold Backup Camera Basic warranty 36 month/36,000 miles Battery charge warning Battery type Lead acid battery Beverage holders Front beverage holders Beverage holders rear Rear beverage holders Blind Spot Monitor Blind spot Blind Spot Information (BSI) System Body panels Fully galvanized steel body panels with side impact beams Bodyside cladding Black bodyside cladding Bodyside insert Chrome bodyside insert Brake Assist Brake assist system Brake type 4-wheel disc brakes Bumper insert Metal-look front and rear bumper inserts Bumper rub strip front Black front bumper rub strip Bumpers front Body-colored front bumper Bumpers rear Black rear bumper Cabin air filter Capless fuel filler Cargo access Proximity cargo area access release Cargo cover Roll-up cargo cover Cargo floor type Carpet cargo area floor Cargo light Cargo area light Cargo tie downs Cargo area tie downs Child door locks Manual rear child safety door locks Climate control Automatic climate control Clock Digital clock Compass Compressor Intercooled turbo Concealed cargo storage Cargo area concealed storage Configurable instrumentation gauges Console insert material Metal-look console insert Conversation mirror Convex spotter Driver convex spotter mirror Corrosion perforation warranty 60 month/unlimited Cruise control Cruise control with steering wheel mounted controls Cylinder head material Aluminum cylinder head Day/Night rearview mirror Delay off headlights Delay-off headlights Door ajar warning Rear cargo area ajar warning Door bins front Driver and passenger door bins Door bins rear Rear door bins Door handle material Body-colored door handles Door locks Power door locks with 2 stage unlocking Door mirror style Body-colored door mirrors Door mirror type Standard style side mirrors Door mirrors Power door mirrors Door panel insert Simulated wood door panel insert Door trim insert Leatherette door trim insert Drive type All-wheel drive Driver attention monitor Driver attention alert Driver foot rest Driver information center Driver lumbar Driver seat with 4-way power lumbar Driver seat direction Driver seat with 8-way directional controls Drivetrain selectable Eco Assist driver selectable drivetrain mode Dual Climate Control Dual-zone front climate control Eco Feedback Eco Assist ECO feedback display gauge Electronic parking brake Electronic stability control Electronic stability control system Emissions LEV3-ULEV50 emissions Emissions tiers Tier 3 Bin 50 emissions Engine 1.5L I-4 gasoline direct injection, DOHC, variable valve control, int… Engine Cylinders I4 Engine Location Front mounted engine Engine Mounting direction Transverse mounted engine Engine block material Aluminum engine block Engine temperature warning Engine/electric motor temperature gauge External memory HondaLink external memory control First-row moonroof First-row sliding and tilting glass moonroof with express… First-row windows Power first-row windows Floor console Full floor console Floor console storage Covered floor console storage Floor coverage Full floor coverage Floor covering Full carpet floor covering Floor mats Carpet front and rear floor mats Fob engine controls Smart Entry with Walk Away Auto Lock with hands-free acc… Fob moonroof controls Keyfob moonroof/convertible roof control Fob remote vehicle controls Keyfob remote engine start Fob window controls Keyfob window control Fog lights LED front fog lights Folding door mirrors Manual folding door mirrors Folding rear seats 60-40 folding rear seats Forward collision warning Collision Mitigation Braking System (CMBS) + FCW f… Front anti-roll Front anti-roll bar Front head restraint control Manual front seat head restraint control Front head restraints Height adjustable front seat head restraints Front impact airbag driver Driver front impact airbag Front impact airbag passenger Passenger front impact airbag Front reading lights Front seat upholstery Leather front seat upholstery Front seatback upholstery Leatherette front seatback upholstery Front side impact airbag driver SmartVent seat mounted side impact driver ai… Front side impact airbag passenger SmartVent seat mounted side impact front … Fuel Type Regular Unleaded Fuel door Manual fuel door release Garage door opener HomeLink garage door opener Gearshifter material Leather gear shifter material Glove box Locking glove box Grille style Grille with chrome bar Handsfree Bluetooth HandsFreeLink handsfree wireless device connectivity Headlight type Reflector headlights Headlights LED low and high beam headlights Headlights on reminder Headliner coverage Full headliner coverage Headliner material Cloth headliner material Heated Seats Heated Steering Wheel Heated door mirrors Heated driver and passenger side door mirrors Heated front seats Heated driver and front passenger seats Heated steering wheel Heated wiper area Heated rear wiper park Height adjustable seatbelts Front height adjustable seatbelts High mount stop light High mounted center stop light Hill Start Assist Ignition Spark ignition system Illuminated entry Illuminated ignition switch Immobilizer Instrumentation display Digital instrumentation display Integrated navigation Honda Satellite-Linked Navigation System integrated na… Interior accents Chrome and metal-look interior accents Interior courtesy lights Fade interior courtesy lights Internet radio capability Pandora compatibility internet radio capability Key in vehicle warning Keyfob cargo controls Keyfob trunk control Keyfob door locks Keyfob activated door locks Keyless Entry Keyless Start LED brake lights Lane Departure Warning Lane departure Lane Keeping Assist System (LKAS) w/Road Departure Mitigation… Leather Seat Trim Leather Seats Locking hub control Permanent locking hub control Low level warnings Low level warning for fuel and brake fluid Low tire pressure warning Multi-level cargo floor Multiple headlights Multiple enclosed headlights Navigation System Noise cancellation Active noise cancellation Number of airbags 6 airbags Number of beverage holders 8 beverage holders Number of doors 4 doors Number of first-row screens 2 total number of 1st row displays Number of memory settings 2 memory settings Occupancy sensor Airbag occupancy sensor Oil pressure warning One-touch down window Driver and passenger one-touch down windows One-touch up window Driver and passenger one-touch up windows Overdrive transmission Overhead airbags Curtain first and second-row overhead airbags Overhead console Mini overhead console Overhead console storage PFEE DLR NBG Paint Pearlcoat paint Panel insert Simulated wood instrument panel insert Passenger doors rear left Conventional left rear passenger door Passenger doors rear right Conventional right rear passenger door Passenger seat direction Front passenger seat with 4-way directional control… Pedestrian detection Collision Mitigation Braking System (CMBS) pedestrian i… Perimeter approach lighting Remote activated perimeter approach lighting Power Driver Seat Power driver seat controls Driver seat power reclining, lumbar support, cush… Power passenger seat controls Passenger seat power reclining and fore/aft co… Powertrain type ICE Powertrain warranty 60 month/60,000 miles Primary display size 7 inch primary display Primary display touchscreen Primary monitor touchscreen RDS Radio data system (RDS) Radiator Radio AM/FM/digital/SiriusXMsatellite Rain Sensing Front Wipers Rain detecting wipers Real time traffic Honda HD Digital Traffic real-time traffic Rear Cross Traffic Alert Rear Spoiler Rear Springs Regular grade rear springs Rear anti-roll Rear anti-roll bar Rear bench seats Split-bench rear seat Rear camera Rear mounted camera Rear cargo door Power liftgate rear cargo door Rear collision warning Cross Traffic Monitor collision warning Rear console climate control ducts Rear head restraint control 3 rear seat head restraints Rear head restraint control Manual rear seat head restraint control Rear head restraints Height adjustable rear seat head restraints Rear seat direction Front facing rear seat Rear seat folding position Fold forward rear seatback Rear seat upholstery Leather rear seat upholstery Rear seatback upholstery Carpet rear seatback upholstery Rear seats fixed or removable Fixed rear seats Rear under seat ducts Rear under seat climate control ducts Rear window defroster Rear windshield Fixed rear windshield Rear windshield wipers Yes rear windshield wipers Rearview mirror Auto-dimming rear view mirror Reclining rear seats Manual reclining rear seats Remote panic alarm Roadside warranty 36 month/36,000 miles Roof rails Running lights LED daytime running lights Satellite trial 3 month satellite trial subscription Seatback storage pockets 1 seatback storage pocket Seatbelt pretensioners Front seatbelt pretensioners Seatbelt pretensioners number 2 seatbelt pre-tensioners Seating capacity 5 Second-row windows Power second-row windows Security system Seek scan Selectable mode transmission Service interval warning Service interval indicator Shock absorbers Gas-pressurized shock absorbers Shutters Active grille shutters Smart device integration Apple CarPlay/Android Auto smart device mirroring Spare tire Compact spare tire with steel wheel Spare tire location Spare tire mounted under the cargo floor Speakers Performance grade speakers Speakers number 9 speakers Special paint Monotone paint Speed sensitive steering Speed sensitive power steering Speed sensitive volume Speed sensitive wipers Split front seats Bucket front seats Spoiler Rear lip spoiler Springs front Front coil springs Springs rear Rear coil springs Stability Control Start-stop engine Idle-Stop auto stop-start engine Steering Electric power-assist steering system Steering mounted audio control Steering wheel mounted audio controls Steering type Rack-pinion steering Steering type number of wheels 2-wheel steering system Steering wheel material Leather and metal-look steering wheel Steering wheel telescopic Manual telescopic steering wheel Steering wheel tilt Manual tilting steering wheel Sunroof/Moonroof Suspension Standard ride suspension Suspension ride type front Independent front suspension Suspension ride type rear Independent rear suspension Suspension type front Strut front suspension Suspension type rear Multi-link rear suspension Tachometer Tailgate control Tailgate/power door lock Tailpipe Stainless steel quasi-dual exhaust with chrome tailpipe finisher Temperature display Exterior temperature display Third-row windows Fixed third-row windows Tinted windows Deep tinted windows Tires P235/55HR19 AS BSW front and rear tires Traction Control Traction control All-speed ABS and driveline traction control Transmission CVT Transmission Type Automatic Transmission electronic control Transmission fluid temperature warning Transmission fluid temp warning Trip computer Trip odometer Trunk hatch Trunk/hatch auto-latching Trunk lid trim Plastic trunk lid trim Turbocharged Turn signal in door mirrors Turn signal indicator in door mirrors USB Port USB ports 4 USB ports Valet key Variable intake manifold Variable panel light Variable instrument panel light Ventilated brakes Front ventilated disc brakes Visor driver mirror Driver visor mirror Visor illuminated driver mirror Illuminated driver visor mirror Visor illuminated passenger mirror Illuminated passenger visor mirror Visor passenger mirror Passenger visor mirror Voice activated audio Voice activated audio controls Voice activated climate control Voice-activated climate control Wheel well trim Black wheel well trim Wheels 19 x 7.5-inch front and rear machined w/painted accents aluminum whee… Window Trim Chrome side window trim Windshield trim Black windshield trim Wipers Variable intermittent front windshield wipers Wireless device charging Front wireless smart device charging Wireless streaming Bluetooth wireless audio streaming Vehicle history by AutoCheck Free AutoCheck Report Accidents or damage None reported Clean title Yes 1-owner vehicle Yes Personal use only Yes The vehicle history information is supplied by third parties. Cars.com and the Seller are not responsible for the accuracy of such information. Cars.com provides this service and materials without representations or warranties of any kind, either expressed or implied. Please see Cars.com Terms and Conditions for further information. Seller’s info Capitol Chevrolet (159 reviews) 905 Capitol Expressway Auto Mall, San Jose, CA 95136 View this car on seller's website Visit Capitol Chevrolet Seller’s notes about this car This DGDG Premium 2022 Honda CR-V Touring with one previous owner and 18,518 miles was inspected and reconditioned by our service team. Reconditioned items on this CR-V include: a fresh oil and filter change. Experience car-buying peace of mindDGDG Premium Used Cars include a 12-month/12,000-mile limited vehicle service contract (see dealer for copy.)Vehicle Features: AWD Intercooled Turbo Regular Unleaded I-4 1.5 L Variable.Disclaimers: Prices do not include tax and license fees, finance charges, $85 dealer document processing charge, $35 electronic filing charge, or any emission testing charge. Be Happy. Check for recalls Have a question? Get answers, see the car, or find a good time for a test drive. Take the next step and contact the seller. Contact seller Contact seller First name Last name Email Phone (optional) Check availabilityGet a price quoteSchedule a test driveDiscuss financingAsk a question Subject I'd like to know if the Used 2022 Honda CR-V AWD Touring you have listed on Cars.com for $29,239 is still available. Comments I have a trade in Choose a makeACAcuraAlfa RomeoAmerican MotorsAm GeneralAston MartinAuburnAudiAustinAustin-HealeyAvanti MotorsBentleyBMWBremenBricklinBugattiBuickCadillacCheckerChevroletChryslerCitroenCordCrosleyDaewooDaihatsuDatsunDelahayeDeloreanDesotoDeTomasoDodgeEagleEdselEssexExcaliburFacel-VegaFerrariFIATFiskerFordFranklinGAZGenesisGeoGMCGriffithHondaHudsonHummerHupmobileHyundaiINEOSINFINITIInternationalIsuzuJaguarJeepJensenKaiserKarmaKiaKoenigseggLamborghiniLanciaLand RoverLaSalleLexusLincolnLotusLucidMaseratiMaybachMazdaMcLarenMercedes-BenzMercuryMerkurMGMINIMitsubishiMorganMorrisNashNissanOldsmobileOpelPackardPaganiPaigePanozPeugeotPierce-ArrowPlymouthPolestarPontiacPorscheQvaleRAMRamblerRenaultRivianRolls-RoyceRoverSaabSaleenSaturnScionsmartSpykerSterlingStudebakerStutzSubaruSunbeamSuzukiTeslaToyotaTriumphTVRVinFastVolkswagenVolvoWillysYugo Make Choose a model Model Choose a year Year Exterior color Mileage VIN (optional) Check availability By clicking here, you authorize Cars.com and its sellers/partners to contact you by text/calls which may include marketing and be by autodialer. Calls may be prerecorded. You also agree to our Privacy Notice. Consent is not required to purchase goods/services. We value your privacy. Cars.com Privacy Notice Price history Listed 76 days ago. $3,310 total price reduction! 6/10/25 Listed $32,588 6/12/25 -$200 $32,388 6/13/25 -$200 $32,188 6/14/25 +$811 $32,999 6/17/25 -$211 $32,788 6/24/25 -$289 $32,499 6/26/25 -$201 $32,298 6/28/25 -$410 $31,888 6/30/25 -$219 $31,669 7/08/25 -$170 $31,499 7/11/25 -$500 $30,999 7/15/25 -$311 $30,688 7/17/25 -$300 $30,388 7/22/25 -$389 $29,999 7/25/25 -$151 $29,848 8/02/25 -$160 $29,688 8/05/25 -$139 $29,549 8/08/25 -$271 $29,278 Total price amount is based on price change information provided by the seller. Customize your payment Based on est. car price of $29,239 at 7.0% APR* and 9.38% sales tax. $545/mo* per month Car price $29,239 Down payment -Not Priced Trade-in value -Not Priced Estimated sales tax 9.38% (based on ZIP) +$2,998 Other fees* Not included Total loan amount $31,980 Total interest paid(over life of loan) +$7,260 Total loan & interest paid $39,240 Monthly payment $545 Your credit rating Excellent (780 - 850)Good (700 - 779)Average (620 - 699)Fair (619 and below) Ad Click to get your FICO® Score - FREE Click to get your FICO® Score - FREE ZIP (optional) Net trade-in value (optional) Estimate trade-in Estimate trade-in Down payment (optional) 36 48 60 72 *Estimated payments are calculated by Cars.com and are for informational purposes only. We’ve estimated your taxes based on your provided ZIP code. These estimates do not include title, registration fees, lien fees, or any other fees that may be imposed by a governmental agency in connection with the sale and financing of the vehicle. Other taxes may apply. They do not represent a financing offer or a guarantee of credit from the seller. Actual terms vary by lender. **Your Saved Vehicles list will be shared along with your contact information when you submit a vehicle request to a dealership. To opt out of this sharing, please view your options on Cars.com Privacy Notice. About your privacy: Cars.com is asking for your ZIP and credit rating because it helps us to make an educated guess at your sales tax and loan interest. These two factors can greatly change your monthly payment. Ad Need financing? Need financing? What's your credit like? What's your credit like? Good to great Good to great Bad to no credit? Bad to no credit? Learn more Learn more Consumer reviews See what others are saying about the 2022 Honda CR-V. (16 reviews) 87% of drivers recommend this car Rating breakdown (out of 5): Comfort 4.6 Interior 4.7 Performance 4.6 Value 4.8 Exterior 4.6 Reliability 4.6 Most recent consumer reviews I love my Honda CRV! April 1, 2025 By Colleen from Toms River, NJ Owns this car I love my Honda CRV! I have always driven Honda Accords, but when none were available, the sales rep recommended the Honda CRV. We took it for a test drive, and it handled very well. The seating is comfortable. The design of the interior and exterior of the CRV is excellent. Would definitely buy it again. Highly recommended! Rating breakdown (out of 5): Comfort 5.0 Interior 5.0 Performance 5.0 Value 5.0 Exterior 5.0 Reliability 5.0 Purchased a New car Used for Having fun Does recommend this car 3 people out of 3 found this review helpful. Did you? Yes No 2022 CRV December 20, 2023 By Timothy Jones from Murfreesboro Tn Owns this car great experience dealing with Darrell Waltrip Honda Alex Leon was on top of all function in and out William Berryman general manager was very helpful and Service and parts top notch Rating breakdown (out of 5): Comfort 5.0 Interior 5.0 Performance 5.0 Value 5.0 Exterior 5.0 Reliability 5.0 Purchased a New car Used for Transporting family Does recommend this car 3 people out of 5 found this review helpful. Did you? Yes No Honda is a good quality car but I have doors probl December 11, 2023 By RG from Los Angeles ca Owns this car My door handles some times don't work well is hard to open I buy this crv 2022 brand new after 4 months I have this problem Rating breakdown (out of 5): Comfort 4.0 Interior 5.0 Performance 4.0 Value 4.0 Exterior 4.0 Reliability 4.0 Purchased a New car Used for Transporting family Does recommend this car 10 people out of 10 found this review helpful. Did you? Yes No See all 16 consumer reviews Explore the 2022 Honda CR-V AWD Touring Similar cars at this dealership Used 2021 Chevrolet Equinox Premier w/1LZ 29,501 mi. $20,449 $839 price drop Great Deal | $976 under Used 2019 INFINITI QX50 Luxe 21,153 mi. $23,629 Fair Deal Used 2020 Acura MDX 3.5L w/Technology Package 39,618 mi. $29,999 $1,189 price drop Good Deal Hot Car Used 2023 Buick Encore GX Essence 14,464 mi. $25,978 Good Deal View all cars at this dealership Ad Car shopper resources Dealer Disclaimer: Prices do not include government fees and taxes any finance charges any dealer document processing charge any electronic filing charge and any emission testing charge. Subject to prior sale. Cars.com Disclaimer: The information on vehicles provided in this service is supplied by the seller or other third parties; Cars.com is not responsible for the accuracy of such information. Cars.com provides this service and materials without representations or warranties of any kind, either expressed or implied. Click here for more details. Bluetooth® is a registered mark of Bluetooth® SIG, Inc. Android Auto™ is a trademark of Google LLC. Apple CarPlay® is a registered trademark of Apple Inc. Burmester is a registered trademark of Burmester Audiosysteme GmbH, Berlin, Germany. *Estimated payments are calculated by Cars.com and are for informational purposes only. We’ve estimated your taxes based on your provided ZIP code. These estimates do not include title, registration fees, lien fees, or any other fees that may be imposed by a governmental agency in connection with the sale and financing of the vehicle. Other taxes may apply. They do not represent a financing offer or a guarantee of credit from the seller. Actual terms vary by lender. **Your Saved Vehicles list will be shared along with your contact information when you submit a vehicle request to a dealership. To opt out of this sharing, please view your options on Cars.com Privacy Notice. Call Check availability Contact seller First name Last name Email Phone (optional) Check availabilityGet a price quoteSchedule a test driveDiscuss financingAsk a question Subject I'd like to know if the Used 2022 Honda CR-V AWD Touring you have listed on Cars.com for $29,239 is still available. Comments I have a trade in Choose a makeACAcuraAlfa RomeoAmerican MotorsAm GeneralAston MartinAuburnAudiAustinAustin-HealeyAvanti MotorsBentleyBMWBremenBricklinBugattiBuickCadillacCheckerChevroletChryslerCitroenCordCrosleyDaewooDaihatsuDatsunDelahayeDeloreanDesotoDeTomasoDodgeEagleEdselEssexExcaliburFacel-VegaFerrariFIATFiskerFordFranklinGAZGenesisGeoGMCGriffithHondaHudsonHummerHupmobileHyundaiINEOSINFINITIInternationalIsuzuJaguarJeepJensenKaiserKarmaKiaKoenigseggLamborghiniLanciaLand RoverLaSalleLexusLincolnLotusLucidMaseratiMaybachMazdaMcLarenMercedes-BenzMercuryMerkurMGMINIMitsubishiMorganMorrisNashNissanOldsmobileOpelPackardPaganiPaigePanozPeugeotPierce-ArrowPlymouthPolestarPontiacPorscheQvaleRAMRamblerRenaultRivianRolls-RoyceRoverSaabSaleenSaturnScionsmartSpykerSterlingStudebakerStutzSubaruSunbeamSuzukiTeslaToyotaTriumphTVRVinFastVolkswagenVolvoWillysYugo Make Choose a model Model Choose a year Year Exterior color Mileage VIN (optional) Check availability By clicking here, you authorize Cars.com and its sellers/partners to contact you by text/calls which may include marketing and be by autodialer. Calls may be prerecorded. You also agree to our Privacy Notice. Consent is not required to purchase goods/services. We value your privacy. Cars.com Privacy Notice Want to sell or trade-in your car fast? Get a free Instant Offer from local dealers. Tell us about your car and get a free Instant Offer within minutes. Schedule a car inspection with the dealer. Use your Instant Offer to trade-in your car. Get your Instant Offer",
  "images": [
    "/images/cars_logo_primary-18fae756e8fa9579eba57ecb7745649a.svg?vsn=d",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Fl-mVrx-vzb1A1sxR-6bp-XcmA8.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/fsnkROlwHkqxHd11GlHOGHEVvwk.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/7bOYKIl10mjwMjIX8f9zuQKrCk0.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Ct4Nn-p3bNhbsqhTwtwhP9GvZUY.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/WpTyn6tzKu3_fN3L4HFuYC_1p44.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/X6JO-n1E_zcJNGToSjx6CtlbpwQ.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/IVguKo3njyvOW61fFDh1qlZaV8o.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Wmxcwa9xfmQN_cxXJUZj09njPFs.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/vW_J5m2ydopFECrmVtceJgeJBAY.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/1AzINtpRDbfjPmSRPEpmytNerXo.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Hchc-Xco3PtXvX-5ByWizW1ydzw.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Z1xd1H2axYihBOZdLfMQRI1wmus.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/wuC5pvi81UiSZPqXSiFgFCmvsWo.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/kxrJxZb8FdR7xxEyQ2YhaHHppXY.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Qj2_N5_MKFVMjOfy7G6QM6Lqqqw.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/FaGNP87y4-6Gh3Y1YeZAuDZBPZk.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/2MLh5GlWukFkkdgaFOPaVAYPsLw.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/fNFBGMtQ3jWVJH3fhJl9LWCAlps.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/GZoxcjHSH4XidXg2DccwHkQ8C-U.jpg",
    "https://platform.cstatic-images.com/xlarge/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/lmEbfBP8sW2qbT66CR3RCQNjdRw.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Fl-mVrx-vzb1A1sxR-6bp-XcmA8.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/fsnkROlwHkqxHd11GlHOGHEVvwk.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/7bOYKIl10mjwMjIX8f9zuQKrCk0.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Ct4Nn-p3bNhbsqhTwtwhP9GvZUY.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/WpTyn6tzKu3_fN3L4HFuYC_1p44.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/X6JO-n1E_zcJNGToSjx6CtlbpwQ.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/IVguKo3njyvOW61fFDh1qlZaV8o.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/Wmxcwa9xfmQN_cxXJUZj09njPFs.jpg",
    "https://platform.cstatic-images.com/small/in/v2/0960af7c-9747-5470-828f-5a86ce5b3dbb/cd09e5fd-af74-48bc-b288-aea2cd7c53d9/vW_J5m2ydopFECrmVtceJgeJBAY.jpg"
  ]
}